import React from 'react';

const About = () => (
     <section id="about" className="min-h-screen px-6 py-12 pt-32 bg-gray-100 flex flex-col md:flex-row items-center">
     {/* טקסט */}
    <div className="w-full md:w-1/2 pr-8">
        <h1 className="text-4xl font-bold">קצת עליי...</h1>
        <p className="mt-4 text-lg">
            שמי כרמי וזאנה, מטפלת מוסמכת עם ניסיון עשיר של למעלה מ-30 שנה בתחום הטיפול הפרטני, הזוגי והמשפחתי. אני בעלת תואר בחינוך, תואר בספרות אנגלית, והכשרה כפסיכותרפיסטית. במהלך השנים עבדתי כיועצת חינוכית בבתי ספר, שם ליוויתי אינספור תלמידים ומשפחותיהם בהתמודדות עם אתגרים חינוכיים, רגשיים ומשפחתיים.
            אני מאמינה בכוחה של שיחה פתוחה, קשובה ועמוקה, ככלי המרכזי לשינוי וצמיחה. כל מפגש בקליניקה שלי הוא מרחב בטוח, תומך ומותאם אישית לצרכים הייחודיים של כל אדם. המטרה שלי היא לסייע לכם לגלות את הכוחות הפנימיים שלכם, לחזק את הביטחון העצמי ולהתגבר על מכשולים שנראים לעיתים בלתי אפשריים.
            במהלך הקריירה שלי, רכשתי מיומנויות ייחודיות בעבודה עם זוגות, הורים ובני נוער. אני מאמינה בתקשורת פתוחה ואותנטית, שמאפשרת לכל אחד ואחת לבטא את עצמו ולהרגיש מובן. מטרתי היא לא רק לטפל באתגרים, אלא גם לעזור לכם לבנות חיים מלאי משמעות, סיפוק ואושר.
            הקליניקה שלי היא מקום שבו תוכלו לעצור, לנשום ולהתמקד בעצמכם. כאן תקבלו את הכלים להתמודד עם האתגרים שלכם, להבין את עצמכם ואת סביבתכם בצורה טובה יותר, ולצאת לדרך חדשה שמבוססת על חוזק, אמון ובחירה חופשית. אני כאן בשבילכם, לכל שאלה, מחשבה או צורך בתמיכה.
            אשמח ללוות אתכם במסע הזה, ולעזור לכם לגלות שאפשר ליצור שינוי אמיתי בחיים.
        </p>
    </div>

    {/* תמונה */}
    <div className="w-full md:w-1/2 flex justify-center">
        <img 
            src="images/image4.webp" 
            alt="תמונה מתאימה לאתר" 
            className="rounded-lg shadow-md w-2/3 h-auto object-cover" 
        />
    </div>
</section>

);

export default About;
